Repository: MohabASHRAF-byte/MentalHealthCourses
Catalog: Src/MentalHealthcare.Application/Resources/Localization/Resources/Messages.*.resx
Languages: ar

# PermissionDenied
source: You are not allowed to perform this action.
ar: غير مسموح لك بتنفيذ هذا الإجراء.

# UserNotFound
source: The user could not be found.
ar: المستخدم غير موجود.

# ThumbnailInvalidSize
source: Thumbnail size must be less than {0} MB.
ar: يجب ألا يتجاوز حجم الصورة المصغرة {0} ميجابايت.

# ThumbnailRequired
source: A thumbnail is required.
ar: يجب إدخال صورة مصغرة.

# ThumbnailInvalidType
source: The thumbnail must be one of the following types: {0}.
ar: يجب أن تكون الصورة المصغرة من الأنواع التالية: {0}.

# IconRequired
source: Icon is required.
ar: الأيقونة مطلوبة.

# IconInvalidType
source: Icon must be one of the following types: {0}.
ar: يجب أن تكون الأيقونة من أحد الأنواع التالية: {0}.

# IconInvalidSize
source: Icon size must be less than {0} KB.
ar: يجب أن يكون حجم الأيقونة أقل من {0} كيلوبايت.

# PageSizeGreaterThanZero
source: Page size must be greater than 0.
ar: يجب أن يكون حجم الصفحة أكبر من {0}.

# PageSizeLessThanOrEqualTo
source: Page size must be {0} or less.
ar: يجب ألا يتجاوز حجم الصفحة {0}.

# SearchTermNotEmpty
source: Search term must not be empty if provided.
ar: يجب ألا يكون مصطلح البحث فارغًا إذا تم توفيره.

# SearchTermMaxLength
source: Search term must not exceed {0} characters.
ar: يجب ألا يتجاوز مصطلح البحث {0} حرفًا.

# SearchTermNoHtml
source: Search term must not contain HTML or markup
ar: يجب ألا يحتوي مصطلح البحث على HTML أو علامات تنسيق.

# EmailInvalidFormat
source: Invalid email address format.
ar: تنسيق عنوان البريد الإلكتروني غير صحيح.

# EmailRequired
source: Email address must not be empty.
ar: يجب ألا يكون عنوان البريد الإلكتروني فارغًا.

# EmailMaxLength
source: Email address must not exceed {0} characters.
ar: يجب ألا يتجاوز عنوان البريد الإلكتروني {0} حرفًا.

# EmailNoHtml
source: Email address must not contain HTML or markup.
ar: يجب ألا يحتوي عنوان البريد الإلكتروني على HTML أو علامات التنسيق.

# NameRequired
source: Name must not be empty.
ar: يجب ألا يكون الاسم فارغًا.

# NameRequiredIfProvided
source: Name must not be empty if provided.
ar: يجب ألا يكون الاسم فارغًا إذا تم توفيره.

# NameMaxLength
source: Name must not exceed {0} characters.
ar: يجب ألا يتجاوز الاسم {0} حرفًا.

# NameNoHtml
source: Name must not contain HTML or markup.
ar: يجب ألا يحتوي الاسم على HTML أو علامات التنسيق.

# PhoneRequired
source: Phone number must not be empty.
ar: يجب ألا يكون رقم الهاتف فارغًا.

# PhoneRequiredIfProvided
source: Phone number must not be empty if provided.
ar: يجب ألا يكون رقم الهاتف فارغًا إذا تم توفيره.

# PhoneInvalidFormat
source: Phone number must contain only digits and be between {0} and {1} characters long.
ar: يجب أن يحتوي رقم الهاتف على أرقام فقط وأن يتراوح طوله بين {0} و {1} حرفًا.

# PhoneNoHtml
source: Phone number must not contain HTML or markup.
ar: يجب ألا يحتوي رقم الهاتف على HTML أو علامات تنسيق.

# UsernameRequired
source: Username must not be empty.
ar: يجب ألا يكون اسم المستخدم فارغًا.

# UsernameMinLength
source: Username must be at least {0} characters long.
ar: يجب أن يتكون اسم المستخدم من {0} أحرف على الأقل.

# UsernameMaxLength
source: Username must not exceed {0} characters.
ar: يجب ألا يتجاوز اسم المستخدم {0} حرفًا.

# UsernameNoHtml
source: Username must not contain HTML or markup.
ar: يجب ألا يحتوي اسم المستخدم على HTML أو علامات تنسيق.

# PasswordRequired
source: Password must not be empty.
ar: يجب ألا تكون كلمة المرور فارغة.

# PasswordMinLength
source: Password must be at least {0} characters long.
ar: يجب أن تتكون كلمة المرور من {0} أحرف على الأقل.

# PasswordMaxLength
source: Password must not exceed {0} characters.
ar: يجب ألا تتجاوز كلمة المرور {0} حرفًا.

# PasswordNoHtml
source: Password must not contain HTML or markup.
ar: يجب ألا تحتوي كلمة المرور على HTML أو علامات تنسيق.

# PasswordLowercase
source: Password must contain at least one lowercase letter.
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل.

# PasswordUppercase
source: Password must contain at least one uppercase letter.
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل.

# PasswordNoCommonSequences
source: Password must not contain common password sequences.
ar: يجب ألا تحتوي كلمة المرور على تسلسلات شائعة.

# PasswordNumber
source: Password must contain at least one number.
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.

# ValueDigitsOnlyNoHtml
source: Value must contain only digits and must not contain HTML or markup.
ar: يجب أن تحتوي القيمة على أرقام فقط وألا تحتوي على HTML أو علامات تنسيق.

# ValueNoHtml
source: Value must not contain HTML or markup.
ar: يجب ألا تحتوي القيمة على HTML أو علامات تنسيق.

# ValueRequiredNoHtml
source: Value must not be empty and must not contain HTML or markup.
ar: يجب ألا تكون القيمة فارغة وألا تحتوي على HTML أو علامات تنسيق.

# BirthDateMaxAge
source: Birth date must not indicate an age older than {0} years.
ar: تاريخ الميلاد يجب ألا يشير إلى عمر يزيد عن {0} سنة.

# BirthDateFuture
source: Birth date must not be in the future.
ar: تاريخ الميلاد يجب ألا يكون في المستقبل.

# PriceNullableNonNegative
source: Price must be null or a non-negative value.
ar: السعر يجب أن يكون فارغًا أو قيمة غير سالبة.

# IdNullablePositive
source: ID must be null or a positive integer.
ar: ID يجب أن يكون عددًا صحيحًا موجبًا.

# IdPositive
source: ID must be a positive integer.
ar: ID يجب أن يكون فارغًا أو عددًا صحيحًا موجبًا.

# PriceNonNegative
source: Price must be a non-negative value.
ar: السعر يجب أن يكون قيمة غير سالبة.

# EmailAlreadyAdmin
source: The email {0} is already an admin.
ar: البريد الإلكتروني {0} هو بالفعل مسؤول.

# EmailAlreadyPending
source: The email {0} is already pending.
ar: البريد الإلكتروني {0} قيد الانتظار بالفعل.

# AdminNotPending
source: {0} can't register with email {1}
ar: {0} لا يمكنه التسجيل بالبريد الإلكتروني {1}

# AdminRegistrationFailed
source: Failed to register admin user {0}.
ar: فشل في تسجيل المسؤول {0}.

# EmailConfirmationSubject
source: Token to confirm your email
ar: رمز لتأكيد بريدك الإلكتروني

# EmailConfirmationFailed
source: Failed to send confirmation email to {0}.
ar: فشل في إرسال بريد التأكيد الإلكتروني إلى {0}.

# OldEmailNotFound
source: Old email not found: {0}
ar: البريد الإلكتروني القديم غير موجود: {0}

# AdMarkedInactive
source: No images were successfully uploaded for Advertisement ID: {0}. Marking as inactive.
ar: لم يتم تحميل أي صور لإعلان بمعرف {0}. يتم تحديده كغير نشط.

# AdCreatedSuccess
source: Advertisement ID: {0} created successfully with {1} images.
ar: تم إنشاء الإعلان بمعرف {0} بنجاح مع {1} صور.

# ImageSizeExceedsLimit
source: Image size cannot be greater than {0} MB.
ar: لا يمكن أن يكون حجم الصورة أكبر من {0} ميجابايت.

# AdNotFound
source: Advertisement with ID {0} not found.
ar: الإعلان ذو الرقم {0} غير موجود.

# AdNameLength
source: Advertisement name length must be between 1 and {0}
ar: يجب أن يتراوح طول اسم الإعلان بين {0} و {1}

# AdMustHaveImage
source: Advertisement must have at least one image.
ar: يجب أن يحتوي الإعلان على صورة واحدة على الأقل.

# AdDescriptionLength
source: Advertisement description length must be between {0} and {1} characters.
ar: يجب أن يتراوح طول وصف الإعلان بين {0} و {1} حرفًا.

# AdminIdentityNotExist
source: Admin with given identity does not exist.
ar: المسؤول ذو الهوية المحددة غير موجود.

# NoCartFound
source: No cart found for the user
ar: لا يوجد سلة لهذا المستخدم.

# CourseSectionsUpdateBlocked
source: Course sections cannot be updated as users have joined the course.
ar: لا يمكن تحديث أقسام الدورة لأن المستخدمين قد انضموا إلى الدورة.

# InvalidHelpCenterItemType
source: Invalid value for {0}: {1}
ar: قيمة غير صالحة لـ {0}: {1}

source: InvalidOrdersForSections
ar: الطلب لا يحتوي على ترتيبات صالحة لجميع الأقسام.

source: Lesson not found.
ar: لم يتم العثور على الدرس.

# InvalidOrderForLessons
source: The request does not contain a valid order for all lessons.
ar: الطلب لا يحتوي على ترتيب صالح لجميع الدروس.

# OrderValuesMustBeSequential
source: Order values must be sequential from 1 to the total number of lessons.
ar: يجب أن تكون قيم الترتيب متسلسلة من ١ إلى العدد الإجمالي للدروس.

# SectionHasNoLessons
source: Section {0} in course {1} has no lessons.
ar: القسم {0} في الدورة {1} لا يحتوي على دروس.

# OrderUpdateBlockedStudentsJoined
source: You can't update this order because students have joined.
ar: لا يمكنك تحديث هذا الترتيب لأن الطلاب قد انضموا.

# PermissionDeniedUpdateLessonsOrder
source: You do not have permission to update the lessons order.
ar: ليس لديك الصلاحية لتحديث ترتيب الدروس.

# InvalidItemType
source: Invalid value for {0}: {1}
ar: قيمة غير صالحة لـ {0}: {1}

# InvalidExpireDateFormat
source: Invalid date format for ExpireDate.
ar: تنسيق تاريخ غير صالح لتاريخ انتهاء غير صالح.

source: Invoice not found.
ar: لم يتم العثور على الفاتورة.

# ExpireDateMustBeFuture
source: ExpireDate must be a future date.
ar: يجب أن يكون تاريخ الانتهاء في المستقبل.

# CourseIdsMustBeUnique
source: All provided course IDs must be unique.
ar: يجب أن تكون جميع معرفات الدورات المقدمة فريدة.

# FileTooLarge
source: The file {0} is too large.
ar: الملف {0} كبير جدًا.

# CourseNotFree
source: Course is not free.
ar: الدورة ليست مجانية.

# CourseAlreadyOwned
source: Course is already owned.
ar: الدورة مملوكة بالفعل.

# CartMaxCapacityReached
source: The cart has reached its maximum item capacity.
ar: وصلت السلة إلى الحد الأقصى لعدد العناصر.

# AlreadyJoinedCourse
source: You have already joined the course.
ar: لقد انضممت بالفعل إلى الدورة.

# CourseNotFound
source: Course does not exist.
ar: الدورة غير موجودة.

# InvalidOrdersForResources
source: The request does not contain valid orders for all resources.
ar: الطلب لا يحتوي على ترتيبات صالحة لجميع الموارد.

# CourseNotInCart
source: The course is not in your cart.
ar: الدورة ليست في سلتك.

# CartIsEmpty
source: The cart is empty.
ar: السلة فارغة.

# InvoiceIdMustBeGreaterThanZero
source: Invoice ID must be greater than 0.
ar: يجب أن يكون معرف الفاتورة أكبر من 0.

# InvalidLessonIdOrNotInCourse
source: Invalid lesson ID or the lesson does not belong to the specified course.
ar: معرف الدرس غير صالح أو أن الدرس لا ينتمي إلى الدورة المحددة.

# UserNotEnrolledInCourse
source: User is not enrolled in this course.
ar: المستخدم غير مسجل في هذه الدورة.

# CourseCompletionRequiredForReview
source: You must complete at least {0}% of the course to leave a review.
ar: يجب عليك إكمال ما لا يقل عن {0}% من الدورة لتتمكن من ترك مراجعة.

# CourseAlreadyInCart
source: The course is already in your cart.
ar: الدورة موجودة بالفعل في سلتك.

# InvoiceNotPending
source: Invoice is not in Pending State.
ar: الفاتورة ليست في حالة الانتظار.

# PromoCodeNameRequired
source: Promo code name cannot be null or empty.
ar: لا يمكن أن يكون اسم رمز الخصم فارغًا أو غير موجود.

# ReviewsLimitReached
source: Reviews limit reached. Delete some before adding a new one.
ar: تم الوصول إلى الحد الأقصى للمراجعات. احذف بعض المراجعات قبل إضافة مراجعة جديدة.

# InvalidOrderStatus
source: Invalid order status provided.
ar: تم تقديم حالة طلب غير صالحة.

# CompletePreviousLessonFirst
source: Complete the previous lesson before proceeding.
ar: أكمل الدرس السابق قبل المتابعة.

# UserAlreadyHasCourse
source: User already has course with ID: {0}.
ar: المستخدم لديه بالفعل دورة : {0}.

# InvalidCourseIdsProvided
source: Invalid course IDs provided: {0}.
ar: تم تقديم معرفات دورات غير صالحة: {0}.

# UnknownContentType
source: Unknown content type: {1}.
ar: نوع المحتوى غير معروف: {1}.

# CourseIconMissing
source: Course with ID {0} does not have an icon for this course.
ar: الدورة بالمعرف {0} ليس لديها أيقونة لهذه الدورة.

# UnspecifiedError
source: An unspecified error occurred.
ar: حدث خطأ غير محدد.

# PdfUploadFailed
source: Failed to upload PDF. Try again.
ar: فشل في رفع ملف PDF. حاول مرة أخرى.

# VideoDeletionFailed
source: Failed to delete video. Try again.
ar: فشل حذف الفيديو. حاول مرة أخرى.

# FileUploadError
source: Error uploading file: {0}. Details: {1}.
ar: خطأ في رفع الملف: {0}. التفاصيل: {1}.

source: Pending upload not found.
ar: لم يتم العثور على الرفع المعلق.

# CourseSectionDeletionError
source: An error occurred while deleting the course section.
ar: حدث خطأ أثناء حذف قسم الدورة.

# ImageUploadFailed
source: Failed to upload the new image.
ar: فشل في رفع الصورة الجديدة.

# VideoCreationUnexpectedError
source: Unexpected error occurred while creating the video.
ar: حدث خطأ غير متوقع أثناء إنشاء الفيديو.

# OldImageDeletionError
source: Error occurred while deleting the old image.
ar: حدث خطأ أثناء حذف الصورة القديمة.

# CourseLessonsUpdateError
source: An error occurred while updating course lessons.
ar: حدث خطأ أثناء تحديث دروس الدورة.

# CoursePromoCodeAlreadyExists
source: Course promo code already exists for the specified course.
ar: رمز الخصم للدورة موجود بالفعل للدورة المحددة.

# ResourceDeletionFailed
source: Failed to delete resource. Please try again.
ar: فشل في حذف المورد. يرجى المحاولة مرة أخرى.

# UnexpectedRole
source: Unexpected role. Access denied.
ar: دور غير متوقع. الوصول مرفوض.

# DeleteReviewNotAllowed
source: You are not allowed to delete this review.
ar: أنت غير مسموح لك بحذف هذا التقييم.

source: Profile data not found.
ar: بيانات الملف الشخصي غير موجودة.

# UsernameAlreadyTaken
source: Username is already taken.
ar: اسم المستخدم مُستخدم بالفعل.

# EmailAlreadyTaken
source: Email is already taken.
ar: البريد الإلكتروني مُستخدم بالفعل.

# EmailNotRegisteredAsAdmin
source: Email is not registered as admin.
ar: البريد الإلكتروني غير مسجل كمدير.

# UserCreationFailed
source: User creation failed. Please try again.
ar: فشل إنشاء المستخدم. يرجى المحاولة مرة أخرى.

# LessonNotInCourse
source: Lesson does not belong to this course.
ar: هذا الدرس لا ينتمي إلى هذه الدورة.

# NotEnrolledInCourse
source: You are not enrolled in this course.
ar: أنت غير مسجل في هذه الدورة.

# WatchPreviousLessonsFirst
source: You should watch previous lessons first.
ar: يجب عليك مشاهدة الدروس السابقة أولاً.

# FailedToUploadIcon
source: Failed to upload icon. Please try again.
ar: فشل في رفع الأيقونة. يرجى المحاولة مرة أخرى.

# TryAgain
source: Please try again.
ar: يرجى المحاولة مرة أخرى.

# FailedToCreateVideoFolder
source: Failed to create video folder. Please try again.
ar: فشل في إنشاء مجلد الفيديو. يرجى المحاولة مرة أخرى.

source: Section should be empty to delete.
ar: يجب أن يكون القسم فارغًا للحذف.

# FailedToUploadImage
source: Failed to upload image. Please try again.
ar: فشل في رفع الصورة. يرجى المحاولة مرة أخرى.

# FailedToDeleteIcon
source: Failed to delete icon. Please try again.
ar: فشل في حذف الأيقونة. يرجى المحاولة مرة أخرى.

# ErrorRemovingLesson
source: Error occurred while removing the lesson.
ar: حدث خطأ أثناء إزالة الدرس.

source: Error adding course lesson.
ar: حدث خطأ أثناء إضافة درس الدورة.

# LessonNoResourcesToUpdate
source: Lesson {0} has no resources to update.
ar: الدرس {0} لا يحتوي على موارد للتحديث.

source: Error updating course sections.
ar: حدث خطأ أثناء تحديث أقسام الدورة.

# CanOnlyChangeToExpired
source: Can only change to 'Expired' if the current status is 'Pending'.
ar: يمكنك التغيير إلى "منتهية" فقط إذا كان الوضع الحالي "معلق".

# LessonHasNoResources
source: Lesson {0} has no resources.
ar: الدرس {0} لا يحتوي على أي موارد.

# CanOnlyChangeToPending
source: Can only change to 'Pending' if the current status is 'Expired' or 'Cancelled'.
ar: يمكنك التغيير إلى "معلق" فقط إذا كان الوضع الحالي "منتهي" أو "ملغي".

# CanOnlyChangeToCancelled
source: Can only change to 'Cancelled' if the current status is 'Pending'.
ar: يمكنك التغيير إلى "ملغي" فقط إذا كان الوضع الحالي "معلق".

# StatusChangeNotAllowed
source: Changing to status '{0}' is not allowed.
ar: تغيير الحالة إلى '{0}' غير مسموح به.
